In [48]:
import mysql.connector as con
from mysql.connector import Error
import pandas as pd

In [49]:
#Table1 - Store
store = pd.read_excel(r"C:\Users\ajay\Documents\B.tech\sem7\DMT\data\datasets\Dataset.xlsx")
store.head()

   Store_id Store_name Products Cust_id
0         1          A       AA      c1
1         2          B       BB      c2
2         3          C       CC      c3
3         4          D       DD      c4
4         5          E       EE      c5

In [50]:
#Table2 - Purchase
purchase= pd.read_excel(r"C:\Users\ajay\Documents\B.tech\sem7\DMT\data\datasets\Dataset.xlsx",sheet_name = 'Purchase')
purchase.head()

  Pur_id  Store_id Cust_id  Quntity  Unit_val  Total_val
0     p1         1      c1        4        20         80
1     p2         2      c2        8         4         32
2     p3         3      c3        5        20        100
3     p4         6      c4        6        10         60
4     p5         4      c5        7        40        280

In [51]:
#Table3 - Customer
Customer = pd.read_excel(r"C:\Users\ajay\Documents\B.tech\sem7\DMT\data\datasets\Dataset.xlsx",sheet_name = 'Customer')
Customer.head()

  Cust_id  Store_id Name  State
0      c1         1   AJ    Mum
1      c2         2   JV    Mum
2      c3         3   RA    Mum
3      c4         4   SH   Bang
4      c5         5   JA  Chenn

In [52]:
def create_DB():
    try:
        conn = con.connect(host="127.0.0.1",database = "test", user = "root", password = "root")
        if(conn.is_connected()):
            cur = conn.cursor()
            cur.execute("CREATE DATABASE IF NOT EXISTS sales")
            conn.commit()
            cur.close()
            
            conn = con.connect(host="127.0.0.1",database="sales",user = "root",password="root")
            cur = conn.cursor()
            return conn,cur
    except Error as e:
        print("error while creating DB",e)

In [53]:
Conn,cur = create_DB()

In [54]:
#Store_table
create_store = """CREATE TABLE IF NOT EXISTS Store(Store_id INT PRIMARY KEY,
Store_name VARCHAR(20),
Products VARCHAR(20),
Cust_id VARCHAR(20))
"""

cur.execute(create_store)
Conn.commit()

In [55]:
#Purchase Table
create_purchase = """CREATE TABLE IF NOT EXISTS Purchase(Pur_id VARCHAR(20) PRIMARY KEY,
Store_id INT,
Cust_id VARCHAR(20),
Quntity INT,
Unit_val INT,
Total_val INT
)"""

cur.execute(create_purchase)
Conn.commit()

In [56]:
# Customer Table
customer_create = """CREATE TABLE IF NOT EXISTS Customer(Cust_id VARCHAR(20),
Store_id INT,
Name VARCHAR(20),
State VARCHAR(20)
)"""

cur.execute(customer_create)
Conn.commit()

In [57]:
#Inseting in store table
cur.execute("TRUNCATE TABLE store")
store_insert = """INSERT INTO STORE(Store_id,Store_name,Products,Cust_id) VALUES (%s,%s,%s,%s)"""

for i,row in store.iterrows():
    cur.execute(store_insert,list(row))
    
Conn.commit()

In [58]:
#Inseting in Purchase table
cur.execute("TRUNCATE TABLE Purchase")
purchase_insert = """INSERT INTO Purchase(Pur_id,Store_id,Cust_id,Quntity,Unit_val,Total_val) VALUES (%s,%s,%s,%s,%s,%s)"""

for i,row in purchase.iterrows():
    cur.execute(purchase_insert,list(row))
    
Conn.commit()

In [59]:
#Inseting in customer table
cur.execute("TRUNCATE TABLE Customer")
customer_insert = """INSERT INTO Customer(Cust_id,Store_id,Name,State) VALUES (%s,%s,%s,%s)"""

for i,row in Customer.iterrows():
    cur.execute(customer_insert,list(row))
    
Conn.commit()

In [60]:
#creatting Connection TEST
try:
    conn = con.connect(host='127.0.0.1',database='test',user='root',password='root')
    if conn.is_connected():
        db_info = conn.get_server_info()
        print("connected to version",db_info)
        cur = conn.cursor()
        cur.execute("select database();")
        record = cur.fetchone()
        print("connected database",record)
        for r in record:
            print(r)
        
except Error as e:
    print("Connection error",e)

connected to version 8.0.30
connected database ('test',)
test

In [ ]:
print("Demo completed")
print("new line")